Revit 2024 API
AreaCreationData Members
The AreaCreationData type exposes the following members.
Constructors
Name | Description
AreaCreationData(Object)
Initializes a new instance of the AreaCreationData class
AreaCreationData(ViewPlan, UV)
The data needed to create a new area
Methods
Name | Description
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
TagPoint
 Specify the location of the area tag.
See Also
AreaCreationData Class
Autodesk.Revit.Creation Namespace